LilithSeraphim/CC2530/HARDWARE/Drive/drive.c
#include "drive.h"
#include <stdio.h>
#include "stm32f4xx.h"
#include "delay.h"
#include "infrared.h"
#include "cba.h"
#include "ultrasonic.h"
#include "canp_hostcom.h"
#include "hard_can.h"
#include "bh1750.h"
#include "syn7318.h"
#include "power_check.h"
#include "can_user.h"
#include "data_base.h"
#include "roadway_check.h"
#include "tba.h"
#include "data_base.h"
#include "swopt_drv.h"
#include "uart_a72.h"
#include "Can_check.h"
#include "delay.h"
#include "can_user.h"
#include "Timer.h"
#include "Rc522.h"
#include "string.h"

/*************************** 自定义变量 *******************************/
static uint8_t Zigbee[8];           // Zigbee发送数据缓存
static uint8_t Infrared[6];         // 红外发送数据缓存
static uint8_t YY_Init[5] = {0xFD, 0x00, 0x00, 0x01, 0x01};
uint16_t tim_a,tim_b;

/**********************************************************************/

/**********************************************************************
 * 函 数 名 ：  道闸系统闸门开启控制
 * 参    数 ：  无
 * 返 回 值 ：  无
 * 简    例 ：  Gate_Open_Zigbee();     // 道闸闸门 -> 开启
**********************************************************************/
void Gate_Open_Zigbee(void)
{
    Send_ZigbeeData_To_Fifo(Gate_Open, 8);		// 道闸 -> 开启
	delay_ms(300);
	Send_ZigbeeData_To_Fifo(Gate_GetStatus, 8);	// 道闸 状态查询
	delay_ms(100);
#if 0
	tim_a = 0;
	tim_b = 0;
    Stop_Flag = 0;
    while(Stop_Flag != 0x05)
    {
        delay_ms(1);
        tim_a++;
        if(tim_a >= 500)
        {
            tim_a = 0;
			tim_b++;
			if (tim_b >= 5) { break;}
			Send_ZigbeeData_To_Fifo(Gate_Open, 8);		// 道闸 -> 开启
			delay_ms(300);
			Send_ZigbeeData_To_Fifo(Gate_GetStatus, 8);	// 道闸 状态查询
			delay_ms(100);
        }
        if(Zigbee_Rx_flag)      // 判读Zigbee数据回传
        {
			Zigbee_Rx_flag = 0;
            if(Zigb_Rx_Buf[1] == 0x03)      // 道闸
            {
                if(Zigb_Rx_Buf[2] == 0x01)
                {
                    Stop_Flag = Zigb_Rx_Buf[4];
                }
            }
        }
    }
#endif
}

/**********************************************************************
 * 函 数 名 ：  道闸系统标志物显示车牌
 * 参    数 ：  *Licence -> 车牌数据（ASICC）
 * 返 回 值 ：  无
 * 简    例 ：  Gate_Show_Zigbee("A123B4");
**********************************************************************/
void Gate_Show_Zigbee(char *Licence)
{
    Zigbee[0] = 0x55;
    Zigbee[1] = 0x03;
    Zigbee[2] = 0x10;
    Zigbee[3] = *(Licence + 0);     // 车牌数据【1】
    Zigbee[4] = *(Licence + 1);     // 车牌数据【2】
    Zigbee[5] = *(Licence + 2);     // 车牌数据【3】
    Zigbee[6] = (Zigbee[2] + Zigbee[3] + Zigbee[4] + Zigbee[5]) % 256;
    Zigbee[7] = 0xBB;
    Send_ZigbeeData_To_Fifo(Zigbee, 8);     // 发送Zigbee数据
    delay_ms(400);
    Zigbee[2] = 0x11;
    Zigbee[3] = *(Licence + 3);     // 车牌数据【4】
    Zigbee[4] = *(Licence + 4);     // 车牌数据【5】
    Zigbee[5] = *(Licence + 5);     // 车牌数据【6】
    Zigbee[6] = (Zigbee[2] + Zigbee[3] + Zigbee[4] + Zigbee[5]) % 256;
    Zigbee[7] = 0xBB;
    Send_ZigbeeData_To_Fifo(Zigbee, 8);     // 发送Zigbee数据
    delay_ms(100);
}

/**********************************************************************
 * 函 数 名 ：  LED显示标志物显示数据
 * 参    数 ：  One,Two,Three   数据（十六进制显示格式）
                rank    1 -> 第一行数码管显示数据
                        2 -> 第二行数码管显示数据（默认）
 * 返 回 值 ：  无
 * 简    例 ：  LED_Date_Zigbee(0x12,0x34,0x56,0x01);
**********************************************************************/
void LED_Date_Zigbee(uint8_t One, uint8_t Two, uint8_t Three, uint8_t rank)
{
    Zigbee[0] = 0x55;
    Zigbee[1] = 0x04;
    if(rank == 1)  Zigbee[2] = 0x01;
    else  Zigbee[2] = 0x02;
    Zigbee[3] = One;
    Zigbee[4] = Two;
    Zigbee[5] = Three;
    Zigbee[6] = (Zigbee[2] + Zigbee[3] + Zigbee[4] + Zigbee[5]) % 256;
    Zigbee[7] = 0xBB;
    Send_ZigbeeData_To_Fifo(Zigbee, 8);
    delay_ms(100);
}

/**********************************************************************
 * 函 数 名 ：  LED显示标志物显示测距信息
 * 参    数 ：  dis 距离值
 * 返 回 值 ：  无
 * 简    例 ：  LED_Dis_Zigbee(123);
**********************************************************************/
void LED_Dis_Zigbee(uint16_t dis)
{
    Zigbee[0] = 0x55;
    Zigbee[1] = 0x04;
    Zigbee[2] = 0x04;
    Zigbee[3] = 0x00;
    Zigbee[4] = dis / 100 % 10;
    Zigbee[5] = ((dis / 10 % 10) * 16 + dis % 10);
    Zigbee[6] = (Zigbee[2] + Zigbee[3] + Zigbee[4] + Zigbee[5]) % 256;
    Zigbee[7] = 0xBB;
    Send_ZigbeeData_To_Fifo(Zigbee, 8);  //发送Zigbee数据
    delay_ms(100);
}

/**********************************************************************
 * 函 数 名 ：  立体显示标志物显示车牌数据
 * 参    数 ：  *src    车牌数据（ASICC）
                x,y     坐标信息
 * 返 回 值 ：  无
 * 简    例 ：  Rotate_show_Inf("A123B4",'C','5');
**********************************************************************/
void Rotate_show_Inf(char* src, char x, char y)
{
    Infrared[0] = 0xFF;			// 起始位
    Infrared[1] = 0x20;			// 模式
    Infrared[2] = *(src + 0);	// 数据【1】
    Infrared[3] = *(src + 1);	// 数据【2】
    Infrared[4] = *(src + 2);	// 数据【3】
    Infrared[5] = *(src + 3);	// 数据【4】
    Infrared_Send(Infrared, 6);
    delay_ms(500);
    Infrared[1] = 0x10;			// 模式
    Infrared[2] = *(src + 4);	// 数据【1】
    Infrared[3] = *(src + 5);	// 数据【2】
    Infrared[4] = x;			// 数据【3】
    Infrared[5] = y;			// 数据【4】
    Infrared_Send(Infrared, 6);
    delay_ms(10);
}

/**********************************************************************
 * 函 数 名 ：  立体显示标志物显示距离信息（单位：ms）
 * 参    数 ：  dis  测距信息（四舍五入）
 * 返 回 值 ：  无
 * 简    例 ：  Rotate_Dis_Inf(123);
**********************************************************************/
void Rotate_Dis_Inf(uint16_t dis)
{
    uint16_t csb = dis; //缓存超声波数据值

    csb += 5;   //四舍五入
    Infrared[0] = 0xFF;
    Infrared[1] = 0x11; //显示距离模式
    Infrared[2] = 0x30 + (uint8_t)(csb / 100 % 10); //距离十位--cm
    Infrared[3] = 0x30 + (uint8_t)(csb / 10 % 10); //距离个位--cm
    Infrared[4] = 0x00;
    Infrared[5] = 0x00;
    Infrared_Send(Infrared, 6);
    delay_ms(100);
}

/**********************************************************************
 * 函 数 名 ：  控制语音播报标志物播报指定文本信息
 * 参    数 ：  *p  --> 需要发送的数据
 * 返 回 值 ：  无
 * 简    例 ：  YY_Play_Zigbee("北京欢迎您");
**********************************************************************/
void YY_Play_Zigbee(char *p)
{
    uint16_t p_len = strlen(p);             // 文本长度

    YY_Init[1] = 0xff & ((p_len + 2) >> 8); // 数据区长度高八位
    YY_Init[2] = 0xff & (p_len + 2);        // 数据区长度低八位
    Send_ZigbeeData_To_Fifo(YY_Init, 5);
    Send_ZigbeeData_To_Fifo((uint8_t *)p, p_len);
    delay_ms(100);
}

/**********************************************************************
 * 函 数 名 ：  控制语音播报标志物播报语音控制命令
 * 参    数 ：  Primary   -> 主指令
                Secondary -> 副职令
                详见附录1
 * 返 回 值 ：  无
 * 简    例 ：  YY_Comm_Zigbee(0x20, 0x01);     // 语音播报随机语音命令

