LilithSeraphim/CC2530/HARDWARE/Drive/drive.c
附录1：
-----------------------------------------------------------------------
| Primary | Secondary | 说明
|---------|-----------|------------------------------------------------
|  0x10   |  0x02     | 向右转弯
|         |  0x03     | 禁止右转
|         |  0x04     | 左侧行驶
|         |  0x05     | 左行被禁
|         |  0x06     | 原地掉头
|---------|-----------|------------------------------------------------
|  0x20   |  0x01     | 随机指令
|---------|-----------|------------------------------------------------
***********************************************************************/
void YY_Comm_Zigbee(uint8_t Primary, uint8_t Secondary)
{
    Zigbee[0] = 0x55;
    Zigbee[1] = 0x06;
    Zigbee[2] = Primary;
    Zigbee[3] = Secondary;
    Zigbee[4] = 0x00;
    Zigbee[5] = 0x00;
    Zigbee[6] = (Zigbee[2] + Zigbee[3] + Zigbee[4] + Zigbee[5]) % 256;
    Zigbee[7] = 0xBB;
    Send_ZigbeeData_To_Fifo(Zigbee, 8);
}

/********************************************************************************
 * 函 数 名 ：  TFT显示标志物控制指令
 * 参    数 ：  Device -> 选择设备
				Pri	   -> 主指令
                Sec1   -> 副职令【1】
				Sec2   -> 副职令【2】
				Sec3   -> 副职令【3】
                详见附录1
 * 返 回 值 ：  无
 * 简    例 ：  TFT_Test_Zigbee('A',0x40,0xA1,0xB2,0xC3);    // TFT显示器显示图形信息

附录1：
--------------------------------------------------------------------------------
| 主指令 | 副指令[1] | 副指令[2] | 副指令[3] |			说明
|--------|-----------|-----------|-----------|-----------------------------------
|  0x10  |	 0x00	 | 0x01~0x20 |   0x00    | 由第二副指令指定显示那张图片
|        |	 0x01    |	 0x00	 |   0x00    | 图片向上翻页
|        |   0x02    |	 0x00	 |   0x00    | 图片向下翻页
|		 |   0x03    |	 0x00    |   0x00    | 图片自动向下翻页显示，间隔时间 10S
|--------|-----------|-----------|-----------|-----------------------------------
|  0x20  |	 0xXX    |	 0xXX	 |   0xXX	 | 车牌前三位数据（ASCII）
|--------|-----------|-----------|-----------|-----------------------------------
|  0x21  |	 0xXX	 |	 0xXX	 |   0xXX	 | 车牌后三位数据（ASCII）
|--------|-----------|-----------|-----------|-----------------------------------
|  0x30  |	 0x00	 |	 0x00	 |   0x00	 | 计时模式关闭
|	 	 |	 0x01	 |	 0x00 	 |   0x00	 | 计时模式打开
| 		 |	 0x02	 |	 0x00	 |   0x00	 | 计时模式清零
|--------|-----------|-----------|-----------|-----------------------------------
|  0x40  |	 0xXX	 |	 0xXX    |   0xXX	 | 六位显示数据（HEX格式）
|--------|-----------|-----------|-----------|-----------------------------------
|  0x50  |	 0x00	 |	 0x0X	 |   0xXX	 | 距离显示模式（十进制）
--------------------------------------------------------------------------------
********************************************************************************/
void TFT_Test_Zigbee(char Device,uint8_t Pri,uint8_t Sec1,uint8_t Sec2,uint8_t Sec3)
{
	Zigbee[0] = 0x55;
	if (Device == 'B') { Zigbee[1] = 0x08; }
	else { Zigbee[1] = 0x0B; }
	Zigbee[2] = Pri;
	Zigbee[3] = Sec1;
	Zigbee[4] = Sec2;
	Zigbee[5] = Sec3;
	Zigbee[6] = (Zigbee[2]+Zigbee[3]+Zigbee[4]+Zigbee[5])%256;
	Zigbee[7] = 0xBB;
	Send_ZigbeeData_To_Fifo(Zigbee, 8);
	delay_ms(100);
}

/**********************************************************************
 * 函 数 名 ：  智能TFT显示器显示距离信息
 * 参    数 ：  dis	距离值
 * 返 回 值 ：  无
 * 简    例 ：  TFT_Dis_Zigbee('A',123);
**********************************************************************/
void TFT_Dis_Zigbee(char Device,uint16_t dis)
{
	Zigbee[0] = 0x55;
	if (Device == 'B') { Zigbee[1] = 0x08; }
	else { Zigbee[1] = 0x0B; }
	Zigbee[2] = 0x50;
	Zigbee[3] = 0x00;
	Zigbee[4] = dis/100%10;
	Zigbee[5] = ((dis/10%10)*16+dis%10);
	Zigbee[6] = (Zigbee[2]+Zigbee[3]+Zigbee[4]+Zigbee[5])%256;
	Zigbee[7] = 0xBB;
	Send_ZigbeeData_To_Fifo(Zigbee, 8);  //发送Zigbee数据
	delay_ms(100);
}


/**********************************************************************
 * 函 数 名 ：  TFT显示器显示车牌
 * 参    数 ：  *Licence -> 车牌数据（ASICC）
 * 返 回 值 ：  无
 * 简    例 ：  TFT_Show_Zigbee('A',"A123B4");
**********************************************************************/
void TFT_Show_Zigbee(char Device,char *Licence)
{
    Zigbee[0] = 0x55;
    if (Device == 'B') { Zigbee[1] = 0x08; }
	else { Zigbee[1] = 0x0B; }
    Zigbee[2] = 0x20;
    Zigbee[3] = *(Licence + 0);     // 车牌数据【1】
    Zigbee[4] = *(Licence + 1);     // 车牌数据【2】
    Zigbee[5] = *(Licence + 2);     // 车牌数据【3】
    Zigbee[6] = (Zigbee[2] + Zigbee[3] + Zigbee[4] + Zigbee[5]) % 256;
    Zigbee[7] = 0xBB;
    Send_ZigbeeData_To_Fifo(Zigbee, 8);     // 发送Zigbee数据
    delay_ms(500);
    Zigbee[2] = 0x21;
    Zigbee[3] = *(Licence + 3);     // 车牌数据【4】
    Zigbee[4] = *(Licence + 4);     // 车牌数据【5】
    Zigbee[5] = *(Licence + 5);     // 车牌数据【6】
    Zigbee[6] = (Zigbee[2] + Zigbee[3] + Zigbee[4] + Zigbee[5]) % 256;
    Zigbee[7] = 0xBB;
    Send_ZigbeeData_To_Fifo(Zigbee, 8);     // 发送Zigbee数据
    delay_ms(100);
}

/********************************************************************************
 * 函 数 名 ：  立体车库标志物控制函数
 * 参    数 ：  Device -> 选择设备
				Pri	   -> 主指令
                Sec1   -> 副职令【1】
                详见附录1
 * 返 回 值 ：  无
 * 简    例 ：  Garage_Test_Zigbee('A',0x01,0x01);    // 立体车库A 到达第一层

附录1：
--------------------------------------------------------------------------------
| 主指令 | 副指令[1] | 副指令[2] | 副指令[3] |			说明
|--------|-----------|-----------|-----------|----------------------------------
|  0x01  |   0x01    |   0x00    |   0x00    | 到达第一层
|        |   0x02    |   0x00    |   0x00    | 到达第二层
|        |   0x03    |   0x00    |   0x00    | 到达第三层
|        |   0x04    |   0x00    |   0x00    | 到达第四层
|--------|-----------|-----------|-----------|----------------------------------
|  0x02  |   0x01    |   0x00    |   0x00    | 请求返回车库位于第几层
|        |   0x02    |   0x00    |   0x00    | 请求返回前后侧红外状态
|--------|-----------|-----------|-----------|----------------------------------
|  0x03  |   0x01    |   0x01    |   0x00    | 返回车库位于第一层
|        |           |   0x02    |   0x00    | 返回车库位于第二层
|        |           |   0x03    |   0x00    | 返回车库位于第三层
|        |           |   0x04    |   0x00    | 返回车库位于第四层
|        |-----------|-----------|-----------|----------------------------------
|        |   0x02    |0x01 触发  |0x01 触发  | 返回车库前后侧红外对管状态
|        |           |0x02 未触发|0x02 未触发| 
|        |           | - 前侧 -  | - 后侧 -  | 
--------------------------------------------------------------------------------
********************************************************************************/
void Garage_Test_Zigbee(char Device,uint8_t Pri,uint8_t Sec1)
{
	Zigbee[0] = 0x55;
	if (Device == 'B') { Zigbee[1] = 0x08; }
	else { Zigbee[1] = 0x0D; }
	Zigbee[2] = Pri;
	Zigbee[3] = Sec1;
	Zigbee[4] = 0x00;
	Zigbee[5] = 0x00;
	Zigbee[6] = (Zigbee[2]+Zigbee[3]+Zigbee[4]+Zigbee[5])%256;
	Zigbee[7] = 0xBB;
	Send_ZigbeeData_To_Fifo(Zigbee, 8);
	delay_ms(100);
}

/**********************************************************************
 * 函 数 名 ：  立体车库到达指定车库
 * 参    数 ：  Device -> 选择设备
				Floor  -> 层数
 * 返 回 值 ：  无
 * 简    例 ：  Garage_Cont_Zigbee('A', 1);	// 立体车库A 到达第一层
**********************************************************************/
void Garage_Cont_Zigbee(char Device,uint8_t Floor)
{
	tim_a = 150;
	tim_b = 0;
	while(1)
	{
		tim_a++;
		delay_ms(10);
		if(!(tim_a%80))
		{
			if (Device == 'B')
			{
				Send_ZigbeeData_To_Fifo(GarageB_Get_Floor, 8);	// 请求车库B返回位于第几层
			} else 
			{
				Send_ZigbeeData_To_Fifo(GarageA_Get_Floor, 8);	// 请求车库A返回位于第几层
			}
		}
		if(tim_a > 200)
		{
			tim_a = 0;
			tim_b++;
//			if(tim_b >= 15) { break; }
			
			if ((Device == 'A') && (Floor == 1))
			{
				Send_ZigbeeData_To_Fifo(GarageA_To1, 8);	// 立体车库A 到达第1层
			} else if ((Device == 'A') && (Floor == 2))
			{
				Send_ZigbeeData_To_Fifo(GarageA_To2, 8);	// 立体车库A 到达第2层
			} else if ((Device == 'A') && (Floor == 3))
			{
				Send_ZigbeeData_To_Fifo(GarageA_To3, 8);	// 立体车库A 到达第3层
			} else if ((Device == 'A') && (Floor == 4))
			{
				Send_ZigbeeData_To_Fifo(GarageA_To4, 8);	// 立体车库A 到达第4层
			} else if ((Device == 'B') && (Floor == 1))
			{
				Send_ZigbeeData_To_Fifo(GarageB_To1, 8);	// 立体车库B 到达第1层
			} else if ((Device == 'B') && (Floor == 2))
			{
				Send_ZigbeeData_To_Fifo(GarageB_To2, 8);	// 立体车库B 到达第2层
			} else if ((Device == 'B') && (Floor == 3))
			{
				Send_ZigbeeData_To_Fifo(GarageB_To3, 8);	// 立体车库B 到达第3层
			} else if ((Device == 'B') && (Floor == 4))
			{
				Send_ZigbeeData_To_Fifo(GarageA_To4, 8);	// 立体车库B 到达第4层
			} else
			{
				Send_ZigbeeData_To_Fifo(GarageA_To1, 8);	// 立体车库A 到达第1层
			}
		}
		if(Zigbee_Rx_flag == 1)	 //zigbee返回信息
		{
			Zigbee_Rx_flag =0;
			if((Zigb_Rx_Buf[0] == 0x55) && (Zigb_Rx_Buf[1] == 0x0D))
			{
				if((Zigb_Rx_Buf[2] == 0x03) && (Zigb_Rx_Buf[3] == 0x01))
				{
					if(Zigb_Rx_Buf[4] == Floor)
					{
						break;
					}
				}
			}
		}
	}
}

/**********************************************************************
 * 函 数 名 ：  ZigBee通讯自定义发送函数
 * 参    数 ：  Head -> 包头
				Pri  -> 主指令
				Sec1,Sec2,Sec3	-> 副职令
 * 返 回 值 ：  无
 * 简    例 ：  Test_Zigbee(0x03,0x01,0x01,0x00,0x00);
**********************************************************************/
void Test_Zigbee(uint8_t Head,uint8_t Pri,uint8_t Sec1,uint8_t Sec2,uint8_t Sec3)
{
	Zigbee[0] = 0x55;
	Zigbee[1] = Head;
	Zigbee[2] = Pri;
	Zigbee[3] = Sec1;
	Zigbee[4] = Sec2;
	Zigbee[5] = Sec3;
	Zigbee[6] = (Zigbee[2]+Zigbee[3]+Zigbee[4]+Zigbee[5])%256;
	Zigbee[7] = 0xBB;
	Send_ZigbeeData_To_Fifo(Zigbee, 8);
	delay_ms(100);
}

/*****************************************************************
 * 函 数 名 ：	自动调节光照强度函数
 * 参    数 ：	gear -> 目标挡位值
 * 返 回 值 ：	gear_init -> 初始挡位值
 * 简     例：	gear_init = Light_Inf(3);	// 智能路灯调至3档
*****************************************************************/
uint8_t Light_Inf(uint8_t gear)
{
	uint8_t i;
	uint8_t gear_init = 0;	// 初始挡位值
	uint16_t array[2];		//缓存自学习的光档位数组
	
	if((gear > 0) && (gear < 5))
	{
		delay_ms(100);
		array[0] = Get_Bh_Value();		//光强度传感器	
		for(i=0; i<4; i++)
		{
			gear_init++;
			Infrared_Send(Light_plus1,4);
			delay_ms(500);
			delay_ms(500);
			delay_ms(500);
			array[1] = Get_Bh_Value();		//光强度传感器
			if (array[0] < array[1]) 
			{
				array[0] = array[1];
				array[1] = 0;
			}
			else
			{
				gear_init = 5 - gear_init;
				break;
			}
		}
		if(gear==2)
		{
			Infrared_Send(Light_plus1,4);	//光源档位加1
		}else if(gear==3)
		{
			Infrared_Send(Light_plus2,4);	//光源档位加2
		}else if(gear==4)
		{
			Infrared_Send(Light_plus3,4);	//光源档位加3
		}
	}
	return gear_init;
}

/*****************************************************************
 * 函 数 名 ：	ETC系统检测
 * 参    数 ：	无
 * 返 回 值 ：	无
 * 简     例：	ETC_Get_Zigbee();	// ETC系统检测
*****************************************************************/
void ETC_Get_Zigbee(void)
{
	tim_a = 0;
	tim_b = 0;
	Stop_Flag = 0;
	while(Stop_Flag != 0x06)
	{
		tim_a++;
		delay_ms(1);
		if(tim_a > 800)
		{
			tim_a = 0;
			tim_b++;
			if(tim_b < 6)
			{
				Car_Back(40, 100);	// 后退
				delay_ms(100);
				Car_Go(40, 110);	//小车前进
			}
			else
			{
				SYN_TTS("ETC系统识别失败，强制通行");
				break;
			}
		}
		
		if(Zigbee_Rx_flag == 1)	 // zigbee返回
		{
			Zigbee_Rx_flag = 0;
			delay_us(5);
			if(Zigb_Rx_Buf[1] == 0x0C)		// ETC系统
			{
				if(Zigb_Rx_Buf[2] == 0x01)
				{
					if(Zigb_Rx_Buf[3] == 0x01)
					{
						Stop_Flag = Zigb_Rx_Buf[4];	  // ETC闸门开启成功
					}
				}
			}
		}
	}
}

/*********************************************************************************
 * 函 数 名 ：	主车向Android终端发送任务请求函数
 * 参    数 ：	Pri  -> 主指令
				Sec  -> 副职令
				详见附录1、附录2
 * 返 回 值 ：	无
 * 简    例 ：	Send_Android(0xA1, 0x01);		// 调用摄像头预设位1


附录1：主车向Android终端发送调用任务指令结构
--------------------------------------------------------
| 主指令 | 副指令 |   说明
|--------|--------|-------------------------------------
|  0xA0  |  0x00  | 启动全自动
|--------|--------|-------------------------------------
|  0xA1  |  0x01  | 调用摄像头预设为1
|        |  0x02  | 调用摄像头预设为2
|        |  0x03  | 调用摄像头预设为3
|        |  0x04  | 调用摄像头预设为4
|        |  0x05  | 调用摄像头预设为5
|--------|--------|-------------------------------------
|  0xA2  |  0x00  | 调用二维码识别
|--------|--------|-------------------------------------
|  0xA3  |  0x00  | 调用交通灯识别
|--------|--------|-------------------------------------
|  0xA4  |  0x00  | 调用车牌识别
|--------|--------|-------------------------------------
|  0xA4  |  0x00  | 调用图形识别
--------------------------------------------------------

