LilithSeraphim/CC2530/HARDWARE/Drive/drive.c
附录2：Android终端向主车发送识别结果指令结构
-------------------------------------------------------------------------------
| 主指令 | 副指令[1] | 副指令[2] | 副指令[3] |		说明
|--------|-----------|-----------|-----------|---------------------------------
|  0xA2  |   0x00    |   0x00    |   0x00	 | 二维码识别成功
|--------|-----------|-----------|-----------|---------------------------------
|  0xA3  |   0x01    |   0x00    |   0x00	 | 交通灯识别成功（红色）
|        |   0x02    |   0x00    |   0x00	 | 交通灯识别成功（黄色）
|        |   0x03    |   0x00    |   0x00	 | 交通灯识别成功（绿色）
|--------|-----------|-----------|-----------|---------------------------------
|  0xA4  |   0xXX    |   0xXX    |   0xXX	 | 车牌识别成功 车牌前三位ASICC
|--------|-----------|-----------|-----------|---------------------------------
|  0xA5  |   0xXX    |   0xXX    |   0xXX	 | 车牌识别成功 车牌后三位ASICC
|--------|-----------|-----------|-----------|---------------------------------
|  0xA6  |   0xXX    |   0xXX    |   0xXX	 | 图形识别 
|        |（三角形） | （圆形）  | （矩形）  | 
-------------------------------------------------------------------------------
*********************************************************************************/
void Send_Android(uint8_t Pri,uint8_t Sec)
{
	Principal_Tab[0] = 0x55;
	Principal_Tab[1] = 0xAA;
	Principal_Tab[2] = Pri;
	Principal_Tab[3] = Sec;
	Send_WifiData_To_Fifo(Principal_Tab, 4);   // 通过Wifi上传主车数据
	UartA72_TxClear();
	UartA72_TxAddStr(Principal_Tab, 4);        // 通过串口上传主车数据
	UartA72_TxStart();
}


/**************************** 运行控制指令 ****************************/
void Car_Go(uint8_t speed, uint16_t temp)   // 主车前进 参数：速度/码盘
{
    Roadway_mp_syn();       // 码盘同步
    Stop_Flag = 0;          // 运行状态标志位
    Go_Flag = 1;            // 前进标志位
    wheel_L_Flag = 0;       // 左转标志位
    wheel_R_Flag = 0;       // 右转标志位
    wheel_Nav_Flag = 0;     // 码盘旋转标志位
    Back_Flag = 0;          // 后退标志位
    Track_Flag = 0;         // 循迹标志位
    temp_MP = temp;         // 码盘值
    Car_Spend = speed;      // 速度值
    Control(Car_Spend, Car_Spend);  // 电机驱动函数
    while(Stop_Flag != 0x03);       // 等待前进完成
}

void Car_Back(uint8_t speed, uint16_t temp) // 主车后退 参数：速度/码盘
{
    Roadway_mp_syn();       // 码盘同步
    Stop_Flag = 0;          // 运行状态标志位
    Go_Flag = 0;            // 前进标志位
    wheel_L_Flag = 0;       // 左转标志位
    wheel_R_Flag = 0;       // 右转标志位
    wheel_Nav_Flag = 0;     // 码盘旋转标志位
    Back_Flag = 1;          // 后退标志位
    Track_Flag = 0;         // 循迹标志位
    temp_MP = temp;         // 码盘值
    Car_Spend = speed;      // 速度值
    Control(-Car_Spend, -Car_Spend); // 电机驱动函数
    while(Stop_Flag != 0x03);       // 等待后退完成
}

void Car_Left(uint8_t speed)       // 主车左转 参数：速度
{
	delay_ms(100);
    Stop_Flag = 0;          // 运行状态标志位
    Go_Flag = 0;            // 前进标志位
    wheel_L_Flag = 1;       // 左转标志位
    wheel_R_Flag = 0;       // 右转标志位
    wheel_Nav_Flag = 0;     // 码盘旋转标志位
    Back_Flag = 0;          // 后退标志位
    Track_Flag = 0;         // 循迹标志位
    Car_Spend = speed;      // 速度值
    Control(-Car_Spend, Car_Spend); // 电机驱动函数
    while(Stop_Flag != 0x02);       // 等待左转完成
	delay_ms(100);
}

void Car_Right(uint8_t speed)       // 主车右转 参数：速度
{
    delay_ms(100);
    Stop_Flag = 0;          // 运行状态标志位
    Go_Flag = 0;            // 前进标志位
    wheel_L_Flag = 0;       // 左转标志位
    wheel_R_Flag = 1;       // 右转标志位
    wheel_Nav_Flag = 0;     // 码盘旋转标志位
    Back_Flag = 0;          // 后退标志位
    Track_Flag = 0;         // 循迹标志位
    Car_Spend = speed;      // 速度值
    Control(Car_Spend, -Car_Spend); // 电机驱动函数
    while(Stop_Flag != 0x02);       // 等待左转完成
    delay_ms(100);
}

void Car_Track(uint8_t speed)   // 主车循迹 参数：速度
{
    Stop_Flag = 0;          // 运行状态标志位
    Go_Flag = 0;            // 前进标志位
    wheel_L_Flag = 0;       // 左转标志位
    wheel_R_Flag = 0;       // 右转标志位
    wheel_Nav_Flag = 0;     // 码盘旋转标志位
    Back_Flag = 0;          // 后退标志位
    Track_Flag = 1;         // 循迹标志位
    Car_Spend = speed;      // 速度值
    Control(Car_Spend, Car_Spend);  // 电机驱动函数 *
    while(Stop_Flag != 0x01);       // 等待循迹完成
}

void Car_L45(int8_t speed, uint16_t times)		// 左旋转 参数：旋转时间
{
	delay_ms(100);
	Send_UpMotor(-speed ,speed);	
	delay_ms(times);
	Send_UpMotor(0 ,0);
	delay_ms(100);
}

void Car_R45(int8_t speed, uint16_t tims)		// 右旋转 参数：旋转时间
{
	delay_ms(100);
	Send_UpMotor(speed,-speed);		// 电机驱动函数
	delay_ms(tims);					// 延时作角度
	Send_UpMotor(0 ,0);				// 停车
	delay_ms(100);
}

void Car_Time_Track(uint8_t speed, uint16_t tims)		// 小车循迹 参数：速度，时间
{
	Stop_Flag = 0;          // 运行状态标志位
    Go_Flag = 0;            // 前进标志位
    wheel_L_Flag = 0;       // 左转标志位
    wheel_R_Flag = 0;       // 右转标志位
    wheel_Nav_Flag = 0;     // 码盘旋转标志位
    Back_Flag = 0;          // 后退标志位
    Track_Flag = 1;         // 循迹标志位
    Car_Spend = speed;      // 速度值
	Control(Car_Spend, Car_Spend);  // 电机驱动函数 *
	if(tims <= 790)
	{
		delay_ms(tims);
	}
	else
	{
		delay_ms(790);
		delay_ms(tims-790);
	}
	Roadway_Flag_clean();	// 清除标志位状态	
	Send_UpMotor(0,0);		// 停车
	delay_ms(100);
}

void CarThread_Go(uint8_t speed, uint16_t temp)   // 主车前进 参数：速度/码盘
{
    Roadway_mp_syn();       // 码盘同步
    Stop_Flag = 0;          // 运行状态标志位
    Go_Flag = 1;            // 前进标志位
    wheel_L_Flag = 0;       // 左转标志位
    wheel_R_Flag = 0;       // 右转标志位
    wheel_Nav_Flag = 0;     // 码盘旋转标志位
    Back_Flag = 0;          // 后退标志位
    Track_Flag = 0;         // 循迹标志位
    temp_MP = temp;         // 码盘值
    Car_Spend = speed;      // 速度值
    Control(Car_Spend, Car_Spend);  // 电机驱动函数
}

void CarThread_Track(uint8_t speed)   // 主车循迹 参数：速度
{
    Stop_Flag = 0;          // 运行状态标志位
    Go_Flag = 0;            // 前进标志位
    wheel_L_Flag = 0;       // 左转标志位
    wheel_R_Flag = 0;       // 右转标志位
    wheel_Nav_Flag = 0;     // 码盘旋转标志位
    Back_Flag = 0;          // 后退标志位
    Track_Flag = 1;         // 循迹标志位
    Car_Spend = speed;      // 速度值
    Control(Car_Spend, Car_Spend);  // 电机驱动函数 *
}

